<details><summary>Show Plan</summary>

```

[command]/home/runner/work/_temp/966882f8-8aa4-496e-a5e5-0fce20784c47/terraform-bin -chdir=terraform show -no-color /tmp/plan.tfplan

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.o11y.grafana_data_source.cloudwatch has been deleted
  - resource "grafana_data_source" "cloudwatch" {
        id                 = "101"
        name               = "staging-staging-cast-cloudwatch"
      - uid                = "qnpeDK1Vk" -> null
        # (5 unchanged attributes hidden)
    }

  # module.o11y.grafana_data_source.prometheus has been deleted
  - resource "grafana_data_source" "prometheus" {
        id                 = "102"
        name               = "staging-staging-cast-amp"
      - uid                = "O62eDFJVz" -> null
        # (6 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.ecs.aws_ecs_service.app_service will be updated in-place
  ~ resource "aws_ecs_service" "app_service" {
        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-cast/staging-cast-service"
        name                               = "staging-cast-service"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:63" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced
-/+ resource "aws_ecs_task_definition" "app_task_definition" {
      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:63" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "staging-cast" -> (known after apply)
      ~ revision                 = 63 -> (known after apply)
      - tags                     = {} -> null
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.o11y.grafana_dashboard.at_a_glance will be created
  + resource "grafana_dashboard" "at_a_glance" {
      + config_json  = (known after apply)
      + dashboard_id = (known after apply)
      + id           = (known after apply)
      + message      = "Updated by Terraform"
      + overwrite    = true
      + slug         = (known after apply)
      + uid          = (known after apply)
      + url          = (known after apply)
      + version      = (known after apply)
    }

  # module.o11y.grafana_data_source.cloudwatch will be created
  + resource "grafana_data_source" "cloudwatch" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + defaultRegion = "eu-central-1"
            }
        )
      + name               = "staging-staging-cast-cloudwatch"
      + type               = "cloudwatch"
      + uid                = (known after apply)
    }

  # module.o11y.grafana_data_source.prometheus will be created
  + resource "grafana_data_source" "prometheus" {
      + access_mode        = "proxy"
      + basic_auth_enabled = false
      + id                 = (known after apply)
      + is_default         = false
      + json_data_encoded  = jsonencode(
            {
              + httpMethod    = "GET"
              + manageAlerts  = false
              + sigV4Auth     = true
              + sigV4AuthType = "ec2_iam_role"
              + sigV4Region   = "eu-central-1"
            }
        )
      + name               = "staging-staging-cast-amp"
      + type               = "prometheus"
      + uid                = (known after apply)
      + url                = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-56c6a09a-0059-4ede-b312-a31cc355fd35/"
    }

Plan: 4 to add, 1 to change, 1 to destroy.
::debug::Terraform exited with code 0.
::debug::stdout: %0ANote: Objects have changed outside of Terraform%0A%0ATerraform detected the following changes made outside of Terraform since the%0Alast "terraform apply" which may have affected this plan:%0A%0A  # module.o11y.grafana_data_source.cloudwatch has been deleted%0A  - resource "grafana_data_source" "cloudwatch" {%0A        id                 = "101"%0A        name               = "staging-staging-cast-cloudwatch"%0A      - uid                = "qnpeDK1Vk" -> null%0A        # (5 unchanged attributes hidden)%0A    }%0A%0A  # module.o11y.grafana_data_source.prometheus has been deleted%0A  - resource "grafana_data_source" "prometheus" {%0A        id                 = "102"%0A        name               = "staging-staging-cast-amp"%0A      - uid                = "O62eDFJVz" -> null%0A        # (6 unchanged attributes hidden)%0A    }%0A%0A%0AUnless you have made equivalent changes to your configuration, or ignored the%0Arelevant attributes using ignore_changes, the following plan may include%0Aactions to undo or respond to these changes.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  + create%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A%0ATerraform will perform the following actions:%0A%0A  # module.ecs.aws_ecs_service.app_service will be updated in-place%0A  ~ resource "aws_ecs_service" "app_service" {%0A        id                                 = "arn:aws:ecs:eu-central-1:898587786287:service/staging-cast/staging-cast-service"%0A        name                               = "staging-cast-service"%0A        tags                               = {}%0A      ~ task_definition                    = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:63" -> (known after apply)%0A        # (15 unchanged attributes hidden)%0A%0A        # (4 unchanged blocks hidden)%0A    }%0A%0A  # module.ecs.aws_ecs_task_definition.app_task_definition must be replaced%0A-/+ resource "aws_ecs_task_definition" "app_task_definition" {%0A      ~ arn                      = "arn:aws:ecs:eu-central-1:898587786287:task-definition/staging-cast:63" -> (known after apply)%0A      ~ container_definitions    = (sensitive value) # forces replacement%0A      ~ id                       = "staging-cast" -> (known after apply)%0A      ~ revision                 = 63 -> (known after apply)%0A      - tags                     = {} -> null%0A        # (9 unchanged attributes hidden)%0A%0A        # (1 unchanged block hidden)%0A    }%0A%0A  # module.o11y.grafana_dashboard.at_a_glance will be created%0A  + resource "grafana_dashboard" "at_a_glance" {%0A      + config_json  = (known after apply)%0A      + dashboard_id = (known after apply)%0A      + id           = (known after apply)%0A      + message      = "Updated by Terraform"%0A      + overwrite    = true%0A      + slug         = (known after apply)%0A      + uid          = (known after apply)%0A      + url          = (known after apply)%0A      + version      = (known after apply)%0A    }%0A%0A  # module.o11y.grafana_data_source.cloudwatch will be created%0A  + resource "grafana_data_source" "cloudwatch" {%0A      + access_mode        = "proxy"%0A      + basic_auth_enabled = false%0A      + id                 = (known after apply)%0A      + is_default         = false%0A      + json_data_encoded  = jsonencode(%0A            {%0A              + defaultRegion = "eu-central-1"%0A            }%0A        )%0A      + name               = "staging-staging-cast-cloudwatch"%0A      + type               = "cloudwatch"%0A      + uid                = (known after apply)%0A    }%0A%0A  # module.o11y.grafana_data_source.prometheus will be created%0A  + resource "grafana_data_source" "prometheus" {%0A      + access_mode        = "proxy"%0A      + basic_auth_enabled = false%0A      + id                 = (known after apply)%0A      + is_default         = false%0A      + json_data_encoded  = jsonencode(%0A            {%0A              + httpMethod    = "GET"%0A              + manageAlerts  = false%0A              + sigV4Auth     = true%0A              + sigV4AuthType = "ec2_iam_role"%0A              + sigV4Region   = "eu-central-1"%0A            }%0A        )%0A      + name               = "staging-staging-cast-amp"%0A      + type               = "prometheus"%0A      + uid                = (known after apply)%0A      + url                = "https://aps-workspaces.eu-central-1.amazonaws.com/workspaces/ws-56c6a09a-0059-4ede-b312-a31cc355fd35/"%0A    }%0A%0APlan: 4 to add, 1 to change, 1 to destroy.%0A
::debug::stderr: 
::debug::exitcode: 0

```

</details>

*Action: `pull_request`*